import matplotlib.pyplot as plt
x = [i for i in range(2, 11)]
y1 = [4.194, 8.185, 10.839, 11.751, 16.977, 14.363, 14.889, 14.470, 11.629]
y2 = [22.060, 37.250, 60.627, 84.553, 90.550, 45.040, 30.007, 34.671, 35.511]
y3 = [7.518, 16.990, 33.997, 62.212, 91.006, 113.923, 76.690, 32.501, 46.382]

y_err_1 = [[0, 0, 0, 0.401, 4.850, 2.714, 3.405, 3.294, 6.456], [11.417, 22.405, 34.509, 35.916, 47.144, 28.695, 41.722, 33.169, 35.667]]
y_err_2 = [[4.500, 1.093, 2.716, 10.708, 0.288, 5.877, 3.808, 6.125, 0.732], [55.258, 93.630, 164.154, 331.860, 611.851, 234.433, 83.716, 87.676, 85.850]]
y_err_3 = [[0, 0, 0, 0, 0, 0.922, 0.691, 0.999, 0.538], [29.037, 58.074, 108.082, 208.098, 398.451, 725.956, 276.254, 113.638, 159.434]]

# Построение графика
plt.xlabel("Кол-во используемых значений для вычисления стоимости товара на следующий месяц", fontsize=18)
plt.ylabel("Cреднее значение относительной погрешности", fontsize=18)
plt.errorbar(x, y1, yerr=y_err_1, label = "Первый товар", capsize=7)
plt.errorbar(x, y2, yerr=y_err_2, label = "Второй товар", capsize=7)
plt.errorbar(x, y3, yerr=y_err_3, label = "Третий товар", capsize=7)
plt.legend()
plt.show()

