# Лабораторная работа: Таблица значений функции

# Назначение программы:
# Расчёт значений функции

# Переменные:
# start, finish, step - начальное, конечное значение и шаг аргумента
# b, d1, d2 - аргумент, первая и вторая функция
# N - количество шагов
# sign, newsign - знак функции d2
# cosign - количество перемен знака функции d2

# Контрольные точки:
# b = 0.20  d1 = -0.23789  d2 = -14.44000
# b = 0.60  d1 = 0.13991   d2 = -8.29600

from math import sqrt
start, finish, step = map(float, input('Введите начальное, конечное значение '\
                                       +'аргумента и шаг через пробел: ').\
                          split())

sign = start**3 + 9.3*start**2 + 7.4*start - 16.3 < 0
cosign = 0

# Начало таблицы
print('\u250C', '\u2500'*10, '\u252C', '\u2500'*11, '\u252C', '\u2500'*11,\
      '\u2510', sep = '')
print('│{:^10s}│{:^11s}│{:^11s}│'. format('b', 'd1', 'd2'))
print('\u251C', '\u2500'*10, '\u253C', '\u2500'*11, '\u253C', '\u2500'*11,\
      '\u2524', sep = '')

N = int((finish - start)/step) + 1

# Расчёт значений функции и их печать
for i in range(N):
    b = start + i*step
    
    if b <= -1: # Если d1 не определена
        d1 = 'Не сущ.'
    else:
        d1 = round(sqrt(b+1) - 1/(b+1) - 0.5, 5)
    
    d2 = b**3 + 9.3*b*b + 7.4*b - 16.3
    if abs(d2) < 10000:
        print('│{:^10.2f}│{:^11}│{:^11.5f}│'.format(b, d1, d2))
    else:
        print('│{:^10.2f}│{:^11}│{:^11.3e}│'.format(b, d1, d2))
    
    if i < N-1:    # Продолжение таблицы
            print('\u251C', '\u2500'*10, '\u253C', '\u2500'*11, '\u253C', \
                  '\u2500'*11, '\u2524', sep = '')
    else:    # Конец таблицы
            print('\u2514', '\u2500'*10, '\u2534', '\u2500'*11, '\u2534', \
                  '\u2500'*11, '\u2518', sep = '')
    
    # Проверка знака d2
    newsign = d2 < 0       
    if sign != newsign:
        cosign += 1
        sign = newsign

print('Количество перемен знака функции d2:', cosign)
