import random


class Shop:
    merchandices = ["Травы", "Барахло", "Оружие и броня", "Ювелирные изделия", "Питание", "Краденое", "Заклинания",
                    "Для охоты", "Фермерство", "Книги"]
    start_hours = list(range(6, 10))
    end_hours = list(range(20, 24))
    names = [
        ["Белый", "Синий", "Красный", "Чёрный", "Зелёный", "Новый", "Старый", "Серый", "Мёртвый", "Мертвецкий",
         "Смеющийся", "Серебрянный", "Золотой", "Медный", "Бронзовый", "Буйный", "Обожжённый", "Спящий", "Пьяный",
         "Злой", "Добрый", "Спокойный", "Нервный", "Замерзший", "Ривервудский", "Виндхельмский", "Солитьюдский",
         "Тёмный", "Светлый", "Вайтранский", "Рифтенский", "Фолкритский", "Умиротворённый", "Драконий", "Дождевой"],
        ["великан", "конь", "осёл", "предел", "пруд", "жук", "молот", "дом", "зал", "забор", "пик", "червь", "дракон",
         "пестик", "паук", "мёд", "флакон", "очаг", "рассвет", "гвоздь", "луг", "камень", "обруч", "медведь", "волк",
         "лось", "ярл", "мертвец", "гной", "огонь", "наконечник", "слиток", "труп", "кирпич", "воин"]
    ]

    def __init__(self):
        pass

    def GetShopInfo(self):
        return random.choice(self.names[0]) + " " + random.choice(self.names[1]), random.choice(self.merchandices), \
               random.choice((True, False)), str(random.choice(self.start_hours)) + ":00", \
               str(random.choice(self.end_hours)) + ":00"
