import random


class Town:
    type = "Деревня"
    town_names = [
        ["Белый", "Синий", "Красный", "Чёрный", "Зелёный", "Новый", "Старый", "Серый", "Мёртвый", "Мертвецкий",
         "Смеющийся", "Серебрянный", "Золотой", "Медный", "Бронзовый", "Буйный", "Обожжённый", "Спящий", "Пьяный",
         "Злой", "Добрый", "Спокойный", "Нервный", "Замерзший", "Ривервудский", "Виндхельмский", "Солитьюдский",
         "Тёмный", "Светлый", "Вайтранский", "Рифтенский", "Фолкритский", "Умиротворённый", "Драконий", "Дождевой"],
        ["великан", "конь", "осёл", "предел", "пруд", "жук", "молот", "дом", "зал", "забор", "пик", "червь", "дракон",
         "пестик", "паук", "мёд", "флакон", "очаг", "рассвет", "гвоздь", "луг", "камень", "обруч", "медведь", "волк",
         "лось", "ярл", "мертвец", "гной", "огонь", "наконечник", "слиток", "труп", "кирпич", "воин"]
    ]

    # Ruler arguments
    male_names = ["Тарстен", "Эрих", "Агвид", "Бьёрн", "Викар", "Инг", "Йорген", "Карл", "Логмэр", "Свейн"]
    female_names = ["Айдис", "Эрна", "Батильда", "Хельга", "Кэролайн", "Марта", "Рагнильд", "Свея", "Фрея", "Торберта"]
    nicknames = ["Огненный глаз", "Клык Сердца", "", "Ранний расвет", "Жестокое море", "Красная рука",
                 "Мастер янтаря", "Серая грива", "Топор Войны", "Буйный ветер"]

    def __init__(self):
        pass

    def GenTownInfo(self):
        gender = random.choice(["Мужчина", "Женщина"])
        name = random.choice(self.male_names) + " " + random.choice(self.nicknames) if gender == "Мужчина" \
            else random.choice(self.female_names)
        name = name.rstrip()

        return random.choice(self.town_names[0]) + " " + random.choice(self.town_names[1]), name, \
               random.randint(100, 1000), self.type
