import matplotlib.pyplot as plt
x = [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000]
y1 = [78.83, 291.00, 665.56, 1160.13, 1819.05, 2630.66, 3494.18, 4617.10, 5990.72, 7337.07]
y2 = [44.63, 184.57, 365.30, 610.15, 910.41, 1284.73, 1806.15, 2393.96, 3002.44, 3626.99]
y3 = [7.61, 17.25, 27.60, 57.50, 76.51, 84.09, 132.21, 172.39, 180.78, 227.67]
# Построение графика
plt.xlabel("Размер массива")
plt.ylabel("Время выполнения (в мкс)")
plt.plot(x, y1, label = "Сортировка пузырьком")
plt.plot(x, y2, label = "Сортировка выбором")
plt.plot(x, y3, label = "Быстрая сортировка")
plt.legend()
plt.show()

