DROP TABLE romashka;
Create table romashka(
	department VARCHAR NOT NULL,
	FIO VARCHAR NOT NULL,
	Date date NOT NULL,
	Status VARCHAR NOT NULL
);

INSERT INTO romashka(department, FIO, Date, Status)
values ('ИТ', 'Иванов Иван Иванович', '15-01-20'::date, 'Больничный'),
	   ('ИТ', 'Иванов Иван Иванович', '16-01-20'::date, 'На работе'),
	   ('ИТ', 'Иванов Иван Иванович', '17-01-20'::date, 'На работе'),
	   ('ИТ', 'Иванов Иван Иванович', '18-01-20'::date, 'На работе'),
	   ('ИТ', 'Иванов Иван Иванович', '19-01-20'::date, 'Оплачиваемый отпуск'),
	   ('ИТ', 'Иванов Иван Иванович', '20-01-20'::date, 'Оплачиваемый отпуск'),
	   ('Бухгалтерия', 'Петрова Ирина Ивановна', '15-01-20'::date, 'Оплачиваемый отпуск'),
	   ('Бухгалтерия', 'Петрова Ирина Ивановна', '16-01-20'::date, 'На работе'),
	   ('Бухгалтерия', 'Петрова Ирина Ивановна', '17-01-20'::date, 'На работе'),
	   ('Бухгалтерия', 'Петрова Ирина Ивановна', '18-01-20'::date, 'На работе'),
	   ('Бухгалтерия', 'Петрова Ирина Ивановна', '19-01-20'::date, 'Оплачиваемый отпуск'),
	   ('Бухгалтерия', 'Петрова Ирина Ивановна', '20-01-20'::date, 'Оплачиваемый отпуск');
	   
select * from romashka;
